# необходимо убрать "", ибо это превращает число в строку
first = 2
second = 3
print(f"фрагмент А до преобразования: {first}{second}")
print(f"фрагмент А: {first + second}")

# Необходимо указать, что вводится не строка, а число
age = int(input("Возраст: "))
print(f"фрагмент Б до преобразования выдаст ошибку, или: {age}1")
print(f"фрагмент Б: {age + 1}")

# необходимо добавить скобки, для правильности выполнения сложения перед делением, а не после него
first = 4
second = 7
third = 10
average = (first + second + third) / 3
print(f"фрагмент В: {average}")